COUNTRY_CITIES = {

    "чехия": [
        "прага",
        "брно",
        "острава",
        "пльзень",
        "оломоуц",
    ],

    "турция": [
        "стамбул",
        "анталья",
        "измир",
        "анкара",
        "аланья",
    ],

    "грузия": [
        "тбилиси",
        "батуми",
        "кутаиси",
        "рустави",
        "гори",
    ],

    "казахстан": [
        "алматы",
        "астана",
        "шымкент",
        "актау",
        "атырау",
    ],

    "россия": [
        "москва",
        "спб",
        "санкт-петербург",
        "казань",
        "сочи",
    ],

    "оаэ": [
        "дубай",
        "абу-даби",
        "шарджа",
        "аджман",
        "рас-эль-хайма",
    ],

    "армения": [
        "ереван",
        "гюмри",
        "ванадзор",
        "дилижан",
        "севан",
    ],

    "сербия": [
        "белград",
        "нови-сад",
        "ниш",
        "суботица",
        "крагуевац",
    ],

    "индия": [
        "дели",
        "мумбаи",
        "гоа",
        "бангалор",
        "калькутта",
    ],

    "вьетнам": [
        "ханой",
        "хошимин",
        "дананг",
        "нячанг",
        "фукуок",
    ],

    "сша": [
        "нью-йорк",
        "лос-анджелес",
        "майами",
        "чикаго",
        "сан-франциско",
    ],

    "америка": [
        "нью-йорк",
        "лос-анджелес",
        "майами",
        "чикаго",
        "сан-франциско",
    ],

    "германия": [
        "берлин",
        "мюнхен",
        "гамбург",
        "франкфурт",
        "кельн",
    ],

    "китай": [
        "пекин",
        "шанхай",
        "гуанчжоу",
        "шэньчжэнь",
        "гонконг",
    ],

    "таиланд": [
        "бангкок",
        "пхукет",
        "паттайя",
        "самуи",
        "чиангмай",
    ],

    "беларусь": [
        "минск",
        "гродно",
        "брест",
        "гомель",
        "витебск",
    ],

    "таджикистан": [
        "душанбе",
        "худжанд",
        "куляб",
        "бохтар",
        "истаравшан",
    ],
}


def city_in_country(city: str, country: str):

    city = city.lower().strip()
    country = country.lower().strip()

    return city in COUNTRY_CITIES.get(country, [])

